#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.storage_layer.random_password.password: Refreshing state... [id=none][0m
[0m[1mmodule.resource_group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core][0m
[0m[1mmodule.storage_layer.data.azurerm_client_config.client_db: Reading...[0m[0m
[0m[1mmodule.vault_layer.data.azurerm_client_config.current_client: Reading...[0m[0m
[0m[1mmodule.storage_layer.data.azurerm_client_config.client_db: Read complete after 0s [id=2022-06-27 19:14:23.301767468 +0000 UTC][0m
[0m[1mmodule.vault_layer.data.azurerm_client_config.current_client: Read complete after 0s [id=2022-06-27 19:14:23.302354578 +0000 UTC][0m
[0m[1mmodule.ingest_layer.azurerm_application_insights.appinsights: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Insights/components/appi-dev-ingest-sunrise-core][0m
[0m[1mmodule.vault_layer.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.KeyVault/vaults/kv-dev-sunrise-core][0m
[0m[1mmodule.ingest_layer.azurerm_app_service_plan.asp: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Web/serverfarms/asp-dev-ingest-sunrise-core][0m
[0m[1mmodule.ingest_layer.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Storage/storageAccounts/sadevingest][0m
[0m[1mmodule.storage_layer.azurerm_mssql_server.sqlserver: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Sql/servers/sql-dev-sunrise-core][0m
[0m[1mmodule.storage_layer.azurerm_mssql_database.sqldatabase: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Sql/servers/sql-dev-sunrise-core/databases/db-dev][0m
[0m[1mmodule.vault_layer.azurerm_key_vault_secret.secret_sql_admin_pass: Refreshing state... [id=https://kv-dev-sunrise-core.vault.azure.net/secrets/secret-dev-sunrise-core-mssql-admin-pass/7589242675b4420d9f8da90aa6ca021d][0m
[0m[1mmodule.vault_layer.azurerm_key_vault_secret.secret_sql_admin: Refreshing state... [id=https://kv-dev-sunrise-core.vault.azure.net/secrets/secret-dev-sunrise-core-mssql-admin/eb68e3647e5d46bea1f54749240540cc][0m
[0m[1mmodule.ingest_layer.azurerm_function_app.function: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Web/sites/func-dev-ingest-sunrise-core][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.base_layer.azurerm_eventgrid_system_topic.system_topic[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_eventgrid_system_topic" "system_topic" {
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m               = "westeurope"
      [32m+[0m [0m[1m[0mmetric_arm_resource_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                   = "eg-system-topic-dev-sunrise-core"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m    = "rg-dev-sunrise-core"
      [32m+[0m [0m[1m[0msource_arm_resource_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"env"      = "dev"
          [32m+[0m [0m"use_case" = "sunrise-core"
        }
      [32m+[0m [0m[1m[0mtopic_type[0m[0m             = "Microsoft.Storage.StorageAccounts"
    }

[1m  # module.storage_layer.azurerm_mssql_database.sqldatabase[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_mssql_database" "sqldatabase" {
      [32m+[0m [0m[1m[0mauto_pause_delay_in_minutes[0m[0m = 60
      [32m+[0m [0m[1m[0mcollation[0m[0m                   = "Latin1_General_100_CI_AI_SC_UTF8"
      [32m+[0m [0m[1m[0mcreate_mode[0m[0m                 = "Default"
      [32m+[0m [0m[1m[0mcreation_source_database_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mextended_auditing_policy[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mgeo_backup_enabled[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mlicense_type[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mmax_size_gb[0m[0m                 = 4
      [32m+[0m [0m[1m[0mmin_capacity[0m[0m                = 0.5
      [32m+[0m [0m[1m[0mname[0m[0m                        = "dev_sunrise_db"
      [32m+[0m [0m[1m[0mread_replica_count[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mread_scale[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mrestore_point_in_time[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0msample_name[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mserver_id[0m[0m                   = "/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Sql/servers/sql-dev-sunrise-core"
      [32m+[0m [0m[1m[0msku_name[0m[0m                    = "GP_S_Gen5_2"
      [32m+[0m [0m[1m[0mstorage_account_type[0m[0m        = "GRS"
      [32m+[0m [0m[1m[0mtags[0m[0m                        = {
          [32m+[0m [0m"env"      = "dev"
          [32m+[0m [0m"use_case" = "sunrise-core"
        }
      [32m+[0m [0m[1m[0mzone_redundant[0m[0m              = (known after apply)

      [32m+[0m [0mlong_term_retention_policy {
          [32m+[0m [0m[1m[0mmonthly_retention[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mweek_of_year[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mweekly_retention[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0myearly_retention[0m[0m  = (known after apply)
        }

      [32m+[0m [0mshort_term_retention_policy {
          [32m+[0m [0m[1m[0mretention_days[0m[0m = (known after apply)
        }

      [32m+[0m [0mthreat_detection_policy {
          [32m+[0m [0m[1m[0mdisabled_alerts[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0memail_account_admins[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0memail_addresses[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mretention_days[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mstate[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mstorage_account_access_key[0m[0m = (sensitive value)
          [32m+[0m [0m[1m[0mstorage_endpoint[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0muse_server_default[0m[0m         = (known after apply)
        }
    }

[1m  # module.storage_layer.azurerm_storage_account.datalake[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_storage_account" "datalake" {
      [32m+[0m [0m[1m[0maccess_tier[0m[0m                       = "Hot"
      [32m+[0m [0m[1m[0maccount_kind[0m[0m                      = "StorageV2"
      [32m+[0m [0m[1m[0maccount_replication_type[0m[0m          = "LRS"
      [32m+[0m [0m[1m[0maccount_tier[0m[0m                      = "Standard"
      [32m+[0m [0m[1m[0mallow_blob_public_access[0m[0m          = false
      [32m+[0m [0m[1m[0menable_https_traffic_only[0m[0m         = true
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0minfrastructure_encryption_enabled[0m[0m = false
      [32m+[0m [0m[1m[0mis_hns_enabled[0m[0m                    = true
      [32m+[0m [0m[1m[0mlarge_file_share_enabled[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                          = "westeurope"
      [32m+[0m [0m[1m[0mmin_tls_version[0m[0m                   = "TLS1_0"
      [32m+[0m [0m[1m[0mname[0m[0m                              = "dldevstore"
      [32m+[0m [0m[1m[0mnfsv3_enabled[0m[0m                     = false
      [32m+[0m [0m[1m[0mprimary_access_key[0m[0m                = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_connection_string[0m[0m    = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_blob_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_connection_string[0m[0m         = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_dfs_endpoint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprimary_dfs_host[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_location[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_endpoint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_host[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mqueue_encryption_key_type[0m[0m         = "Service"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m               = "rg-dev-sunrise-core"
      [32m+[0m [0m[1m[0msecondary_access_key[0m[0m              = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_connection_string[0m[0m  = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_blob_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_connection_string[0m[0m       = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_dfs_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_dfs_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_location[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mshared_access_key_enabled[0m[0m         = true
      [32m+[0m [0m[1m[0mtable_encryption_key_type[0m[0m         = "Service"
      [32m+[0m [0m[1m[0mtags[0m[0m                              = {
          [32m+[0m [0m"env"      = "dev"
          [32m+[0m [0m"use_case" = "sunrise-core"
        }

      [32m+[0m [0mblob_properties {
          [32m+[0m [0m[1m[0mchange_feed_enabled[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mdefault_service_version[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mlast_access_time_enabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mversioning_enabled[0m[0m       = (known after apply)

          [32m+[0m [0mcontainer_delete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mdelete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mcustomer_managed_key {
          [32m+[0m [0m[1m[0mkey_vault_key_id[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0muser_assigned_identity_id[0m[0m = (known after apply)
        }

      [32m+[0m [0mnetwork_rules {
          [32m+[0m [0m[1m[0mbypass[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mdefault_action[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mip_rules[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_network_subnet_ids[0m[0m = (known after apply)

          [32m+[0m [0mprivate_link_access {
              [32m+[0m [0m[1m[0mendpoint_resource_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mendpoint_tenant_id[0m[0m   = (known after apply)
            }
        }

      [32m+[0m [0mqueue_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mhour_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }

          [32m+[0m [0mlogging {
              [32m+[0m [0m[1m[0mdelete[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mread[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mwrite[0m[0m                 = (known after apply)
            }

          [32m+[0m [0mminute_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }
        }

      [32m+[0m [0mrouting {
          [32m+[0m [0m[1m[0mchoice[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mpublish_internet_endpoints[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mpublish_microsoft_endpoints[0m[0m = (known after apply)
        }

      [32m+[0m [0mshare_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mretention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0msmb {
              [32m+[0m [0m[1m[0mauthentication_types[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mchannel_encryption_type[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mkerberos_ticket_encryption_type[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversions[0m[0m                        = (known after apply)
            }
        }
    }

[0m[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @fezepeda, Action: `pull_request`*